'''
Реализуйте очередь с приоритетами. Ваша очередь должна поддерживать сле-
дующие операции: добавить элемент, извлечь минимальный элемент, уменьшить
элемент, добавленный во время одной из операций.
• Формат входного файла (input.txt). В первой строке входного файла 
содержится число n (1 ≤ n ≤ 10^6) - число операций с очередью.
Следующие n строк содержат описание операций с очередью, по одному
описанию в строке. Операции могут быть следующими:
– A x – требуется добавить элемент x в очередь.
– X – требуется удалить из очереди минимальный элемент и вывести
его в выходной файл. Если очередь пуста, в выходной файл требуется
вывести звездочку «*».
– D x y – требуется заменить значение элемента, добавленного в очередь
операцией A в строке входного файла номер x + 1, на y. 
Гарантируется, что в строке x + 1 действительно находится операция A, что
этот элемент не был ранее удален операцией X, и что y меньше, чем
предыдущее значение этого элемента.
В очередь помещаются и извлекаются только целые числа, не превышающие
по модулю 10^9.
• Формат выходного файла (output.txt). Выведите последовательно 
результат выполнения всех операций X, по одному в каждой строке выходного
файла. Если перед очередной операцией X очередь пуста, выведите вместо
числа звездочку «*».
• Ограничение по времени. 2 сек.
• Ограничение по памяти. 256 мб.
'''

import time
 
t_start = time.perf_counter()



print("Время работы: %s секунд " % (time.perf_counter() - t_start))